[F_Pharmacist X2SoldierClassTemplate]
+DisplayName="Pharmacist"
+ClassSummary="The Pharmacist is an expert at keeping our soldiers alive. When they aren't busy treating the wounded, they spend their time inflicting debilitating effects on the enemy force."
+LeftAbilityTreeTitle="Doctor"
+RightAbilityTreeTitle="Dealer"
+AbilityTreeTitles[0]="Doctor"
+AbilityTreeTitles[1]="Assistant"
+AbilityTreeTitles[2]="Dealer"
;NICKNAMES
+RandomNickNames[0]="Doc"
+RandomNickNames[1]="Holiday"
+RandomNickNames[2]="Sticks"
+RandomNickNames[3]="Sawbones"
+RandomNickNames[4]="Pills"
+RandomNickNames[5]="Scrubs"
+RandomNickNames[6]="Slicer"
+RandomNickNames[7]="Tourney"
+RandomNickNames[8]="Quack"
+RandomNickNames[9]="Charlatan"
+RandomNickNames[10]="Pain"
+RandomNickNames[11]="Fee"
+RandomNickNames[12]="Hands"
+RandomNickNames[13]="Chaser"
+RandomNickNames[14]="Chops"
+RandomNickNames[15]="Emergency"
+RandomNickNames[16]="Skull"
+RandomNickNames[17]="Pusher"
+RandomNickNames[18]="Frankenstein"
+RandomNickNames[19]="Jekyll"
+RandomNickNames[20]="Hyde"
+RandomNickNames[21]="Butcher"
+RandomNickNames[22]="Front"
+RandomNickNames[23]="Psych"
+RandomNickNames[24]="Lab"
+RandomNickNames[25]="Beaker"
+RandomNickNames[26]="Dre"
+RandomNickNames[27]="Junkie"
+RandomNickNames[28]="Insurance"
+RandomNickNames[29]="Healbot"
+RandomNickNames[30]="Healer"
+RandomNickNames[31]="Patch"
+RandomNickNames_Male[0]="Bones"
+RandomNickNames_Male[1]="Needle"
+RandomNickNames_Male[2]="Mac"
+RandomNickNames_Male[3]="Medicine Man"
+RandomNickNames_Female[0]="Whitecoat"
+RandomNickNames_Female[1]="Heartbeat"
+RandomNickNames_Female[2]="Eyes"
+RandomNickNames_Female[3]="Lamb"
+RandomNickNames_Female[4]="Giggles"

; Items

[StimGun_CV X2WeaponTemplate]
FriendlyName="Stim Gun"
FriendlyNamePlural="Stim Guns"
BriefSummary="The Stim Gun is a device capable of firing small darts. These darts can be charged with restorative chemicals or laced with deadly poison."
TacticalText="<Bullet/> Stims require one action to be fired, and do not end the turn when used as the first action.\n<Bullet/> Through proper training, the capabilities of the recovery and venom stims can be greatly enhanced.\n<Bullet/> Increases healing by you by <Ability:RECOVERYSTIM_BONUS_HEAL_CV/> points.\n"
AbilityDescName="stim gun"

[StimGun_MG X2WeaponTemplate]
FriendlyName="Stim Blaster"
FriendlyNamePlural="Stim Blasters"
BriefSummary="The Stim Blaster is an improved version of the Stim Gun, capable of chambering more potent chemical mixtures."
TacticalText="<Bullet/> Stims require one action to be fired, and do not end the turn when used as the first action.\n<Bullet/> Through proper training, the capabilities of the recovery and venom stims can be greatly enhanced.\n<Bullet/> Increases healing by you by <Ability:RECOVERYSTIM_BONUS_HEAL_MG/> points.\n<Bullet/> Grants one additional use of Recovery Stim and Venom Stim.\n"
AbilityDescName="stim blaster"

[StimGun_BM X2WeaponTemplate]
FriendlyName="Stim Ray"
FriendlyNamePlural="Stim Rays"
BriefSummary="The Stim Ray is our most powerful support tool. It uses advanced beam technology to transmit its effects directly to the target."
TacticalText="<Bullet/> Stims require one action to be fired, and do not end the turn when used as the first action.\n<Bullet/> Through proper training, the capabilities of the recovery and venom stims can be greatly enhanced.\n<Bullet/> Increases healing by you by <Ability:RECOVERYSTIM_BONUS_HEAL_BM/> points.\n<Bullet/> Grants two additional uses of Recovery Stim and Venom Stim.\n"
AbilityDescName="stim ray"

; Schematics

[StimGun_MG_Schematic X2SchematicTemplate]
m_strClassLabel="PHARMACIST"
[StimGun_BM_Schematic X2SchematicTemplate]
m_strClassLabel="PHARMACIST"

; Abilities

[SG_RecoveryStim X2AbilityTemplate]
LocFriendlyName="Recovery Stim"
LocFlyOverText="Recovery Stim"
LocLongDescription="Fire a stim at an ally that restores health and removes burning, poison, and acid."
LocHelpText="Fire a stim at an ally that restores health and removes burning, poison, and acid."
LocPromotionPopupText="<Bullet/> Recovery Stim effectively applies a Medikit heal to a distant ally.<br/><Bullet/> Starts with <Ability:RECOVERYSTIM_BASE_CHARGES> use, but each equipped Medikit grants an additional use.<br/><Bullet/> Requires one action and does not end the user's turn.<br/><Bullet/> You must have line of sight to the target, and they must be within normal weapon range.<br/>"

[SG_RecoveryStim_Passive X2AbilityTemplate]
LocFriendlyName="Recovery Stim"
LocFlyOverText="Recovery Stim"
LocLongDescription="Fire a stim at an ally that restores health and removes burning, poison, and acid."
LocHelpText="Fire a stim at an ally that restores health and removes burning, poison, and acid."
LocPromotionPopupText="<Bullet/> Recovery Stim effectively applies a Medikit heal to a distant ally.<br/><Bullet/> Starts with <Ability:RECOVERYSTIM_BASE_CHARGES> use, but each equipped Medikit grants an additional use.<br/><Bullet/> Requires one action and does not end the user's turn.<br/><Bullet/> You must have line of sight to the target, and they must be within normal weapon range.<br/>"

[SG_VenomStim X2AbilityTemplate]
LocFriendlyName="Venom Stim"
LocFlyOverText="Venom Stim"
LocLongDescription="Fire a stim at an enemy that deals no damage, but applies poison. This attack cannot miss."
LocHelpText="Fire a stim at an enemy that deals no damage, but applies poison. This attack cannot miss."
LocPromotionPopupText="<Bullet/> Venom Stim cannot be used against targets that are immune to poison.<br/><Bullet/> Starts with <Ability:VENOMSTIM_BASE_CHARGES> use, but each equipped Medikit grants an additional use.<br/><Bullet/> Requires one action and does not end the user's turn.<br/><Bullet/> You must have line of sight to the target, and they must be within normal weapon range.<br/>"

[SG_VenomStim_Passive X2AbilityTemplate]
LocFriendlyName="Venom Stim"
LocFlyOverText="Venom Stim"
LocLongDescription="Fire a stim at an enemy that deals no damage, but applies poison. This attack cannot miss."
LocHelpText="Fire a stim at an enemy that deals no damage, but applies poison. This attack cannot miss."
LocPromotionPopupText="<Bullet/> Venom Stim cannot be used against targets that are immune to poison.<br/><Bullet/> Starts with <Ability:VENOMSTIM_BASE_CHARGES> use, but each equipped Medikit grants an additional use.<br/><Bullet/> Requires one action and does not end the user's turn.<br/><Bullet/> You must have line of sight to the target, and they must be within normal weapon range.<br/>"

[SG_PinsAndNeedles X2AbilityTemplate]
LocFriendlyName="Pins and Needles"
LocFlyOverText="Pins and Needles"
LocLongDescription="Your Venom Stims now deal a small amount of guaranteed damage to the target."
LocHelpText="Your Venom Stims now deal a small amount of guaranteed damage to the target."
LocPromotionPopupText="<Bullet/> Venom Stim still can only be used against targets that are vulnerable to poison.<br/><Bullet/> More advanced Stim Guns will deal more damage.<br/>"

[SG_Neurotoxin X2AbilityTemplate]
LocFriendlyName="Neurotoxin"
LocFlyOverText="Neurotoxin"
LocLongDescription="Venom Stims now also disorient the target."
LocHelpText="Venom Stims now also disorient the target."
LocPromotionPopupText="<Bullet/> Venom Stim still can only be used against targets that are vulnerable to poison.<br/>"

[SG_LingeringEffects X2AbilityTemplate]
LocFriendlyName="Lingering Effects"
LocFlyOverText="Lingering Effects"
LocLongDescription="Recovery Stims grant health regeneration for a few turns."
LocHelpText="Recovery Stims grant health regeneration for a few turns."
LocPromotionPopupText="<Bullet/> This ability will restore <Ability:LINGERINGEFFECTS_HEAL_PER_TURN> health at the beginning of each turn, up to a maximum of <Ability:LINGERINGEFFECTS_MAX_HEALTH>.<br/><Bullet/> The regeneration effect can only be granted once to each ally on a mission.<br/>"

[SG_OverTheCounter X2AbilityTemplate]
LocFriendlyName="Over the Counter"
LocFlyOverText="Over the Counter"
LocLongDescription="Grants <Ability:OVERTHECOUNTER_BONUS_RECOVERY_STIMS> additional Recovery Stim uses."
LocHelpText="Grants <Ability:OVERTHECOUNTER_BONUS_RECOVERY_STIMS> additional Recovery Stim uses."
LocPromotionPopupText="<Bullet/> Grants <Ability:OVERTHECOUNTER_BONUS_RECOVERY_STIMS> additional Recovery Stim uses.<br/>"

[SG_UnderTheTable X2AbilityTemplate]
LocFriendlyName="Under the Table"
LocFlyOverText="Under the Table"
LocLongDescription="Grants <Ability:UNDERTHECOUNTER_BONUS_VENOM_STIMS> additional Venom Stim uses."
LocHelpText="Grants <Ability:UNDERTHECOUNTER_BONUS_VENOM_STIMS> additional Venom Stim uses."
LocPromotionPopupText="<Bullet/> Grants <Ability:UNDERTHECOUNTER_BONUS_VENOM_STIMS> additional Venom Stim uses.<br/>"

[SG_CombatClinic X2AbilityTemplate]
LocFriendlyName="Combat Clinic"
LocFlyOverText="Combat Clinic"
LocLongDescription="Fire a Recovery Stim at all allies that you can see, including yourself."
LocHelpText="Fire a Recovery Stim at all allies that you can see, including yourself."
LocPromotionPopupText="<Bullet/> One charge per mission.<br/><Bullet/> Bonuses from Savior and Lingering Effects apply to Combat Clinic.<br/>"

[SG_QuickStim X2AbilityTemplate]
LocFriendlyName="Quick Stim"
LocFlyOverText="Quick Stim"
LocLongDescription="Activate this ability to make your next Stim Gun ability this turn not cost an action point."
LocHelpText="Activate this ability to make your next Stim Gun ability this turn not cost an action point."
LocPromotionPopupText="<Bullet/> <Ability:QUICKSTIM_COOLDOWN> turn cooldown.<br/><Bullet/> Applies to Recovery Stim, Venom Stim, Combat Clinic and Toxic Cloud.<br/>"

[SG_ToxicCloud X2AbilityTemplate]
LocFriendlyName="Toxic Cloud"
LocFlyOverText="Toxic Cloud"
LocLongDescription="Fire a special stim that functions as a normal Venom Stim against the target, and also releases a large poison cloud in an area around them."
LocHelpText="Fire a special stim that functions as a normal Venom Stim against the target, and also releases a large poison cloud in an area around them."
LocPromotionPopupText="<Bullet/> One charge per mission.<br/><Bullet/> Bonuses from Pins and Needles and Neurotoxin apply to both the primary target and the targets in the area of effect.<br/>"

[SG_IncreasedDosage X2AbilityTemplate]
LocFriendlyName="Increased Dosage"
LocFlyOverText="Increased Dosage"
LocLongDescription="Poison applied by you deals more damage over time."
LocHelpText="Poison applied by you deals more damage over time."
LocPromotionPopupText="<Bullet/> Increases poison tick damage by <Ability:INCREASEDDOSAGE_DOT_BONUS>.<br/><Bullet/> Applies to all forms of poison that you cause, including poison from Venom Stims and Gas Grenades.<br/>"

[SG_NitroStim X2AbilityTemplate]
LocFriendlyName="Nitro Stim"
LocFlyOverText="Nitro Stim"
LocLongDescription="Fire a stim at an ally that grants them +<Ability:NITROSTIM_CRIT_BONUS/> Critical Chance and +<Ability:NITROSTIM_MOBILITY_BONUS/> Mobility for <Ability:NITROSTIM_DURATION/> turns."
LocHelpText="Fire a stim at an ally that grants them +<Ability:NITROSTIM_CRIT_BONUS/> Critical Chance and +<Ability:NITROSTIM_MOBILITY_BONUS/> Mobility for <Ability:NITROSTIM_DURATION/> turns."
LocPromotionPopupText="<Bullet/> Multiple uses of the ability do not stack.<br/><Bullet/> Starts with <Ability:NITROSTIM_BASE_CHARGES> use, but gains one extra use with each Stim Gun upgrade.<br/><Bullet/> Requires one action and does not end the user's turn.<br/><Bullet/> You must have line of sight to the target, and they must be within normal weapon range.<br/>"

[SG_FocusStim X2AbilityTemplate]
LocFriendlyName="Focus Stim"
LocFlyOverText="Focus Stim"
LocLongDescription="Fire a stim at an ally that grants them +<Ability:FOCUSSTIM_AIM_BONUS/> Aim for <Ability:FOCUSSTIM_DURATION/> turns."
LocHelpText="Fire a stim at an ally that grants them +<Ability:FOCUSSTIM_AIM_BONUS/> Aim for <Ability:FOCUSSTIM_DURATION/> turns."
LocPromotionPopupText="<Bullet/> Multiple uses of the ability do not stack.<br/><Bullet/> Starts with <Ability:FOCUSSTIM_BASE_CHARGES> use, but gains one extra use with each Stim Gun upgrade.<br/><Bullet/> Requires one action and does not end the user's turn.<br/><Bullet/> You must have line of sight to the target, and they must be within normal weapon range.<br/>"

[SG_StabilizeStim X2AbilityTemplate]
LocFriendlyName="Stabilize Stim"
LocFlyOverText="Stabilize Stim"
LocLongDescription="Stop a soldier from bleeding out by shooting them with a dart from range. Consumes one charge (which is shared with Recovery Stim)."
LocHelpText="Stop a soldier from bleeding out."

[SG_Savior X2AbilityTemplate]
LocFriendlyName="Savior"
LocFlyOverText="Savior"
LocLongDescription="Healing abilities restore <Ability:SAVIOR_BONUS_HEAL_AMMOUNT> additional hit points."
LocHelpText="Healing abilities restore <Ability:SAVIOR_BONUS_HEAL_AMMOUNT> additional hit points."
LocPromotionPopupText="<Bullet/> Effect applies to GREMLIN heal, Medikits, Recovery Stims and Restoration abilities.<br/>"




